[
  {
    "id": 2025536,
    "job_title": "Licensed Beauty Advisor",
    "job_description": "Job ID: 234414 \nStore Name/Number: CA-Topanga (0186) \nAddress: 6600 Topanga Canyon Blvd, Canoga Park, CA 91303, United States\n(US) \nHourly/Salaried: Hourly (Non-Exempt) \nFull Time/Part Time: Part Time \nPosition Type: Regular  \n\nLicensed Beauty Advisor (Cosmetology, Esthetician) \nAs our Licensed Beauty Advisor, you are an expert in all thing's beauty!\nYou're here to guide our clients on their beauty journey at the Beauty Studio\n& beyond. It's not just about the product, but about making a client's day\nthrough teaching, inspiring, and playing, together. Best of all, you'll love\nworking with our diverse teams and leaders, who really care about you and help\nyou evolve \nYour responsibilities include  \n\n\n* Creating Amazing Customer Experience Provide a welcoming environment for our clients by listening to their unique needs. Unleash your creativity, passion, and knowledge of our iconic brands during every interaction. Deliver exceptional customized paid service experiences including applications, product knowledge and lessons in makeup, skincare and waxing. Suggest and sell products and services and introduce clients to our loyalty programs. Create memorable experiences that help make Sephora the most loved Beauty Community\n* Supporting Store Success Help make a beautiful first impression by keeping the store sparkling and stocked. Drive results by contributing to your store's sales goals and sharing your knowledge of Sephora's policies and standards. Support special events, promotions, and priorities as needed. Ensure all state license requirements are met regarding paid services. Support store priorities and participate in inventory control and programs to prevent loss, as needed\n* Demonstrate our Sephora values Passion, Innovation, Expertise, Balance, Respect, Teamwork, and Initiative\n\n\nWe would love to hear from you if have  \n\n\n* 1-3 years' prior experience working in retail sales or services industries\n* A License to perform paid services as required by the state in which you work\n* Knowledge about what's new and trending with beauty products\n* A passion for client service, selling and working with people\n* Strong communication, able to multitask and comfortable with computer/store systems\n* Resilience and the ability to react to situations in-the-moment and stay aware of changing store priorities\n* Consistent and reliable attendance\n* flexible availability to work during peak retail hours such as nights, weekends, and holidays\n* Ability to lift and carry up to 50 pounds, bend/stretch to stock shelves, stand/walk the sales floor for an entire shift, work in a fragrance filled environment & handle and apply cosmetics products to clients-with or without accommodation\n* Adherence to Sephora's dress code and policies in the Employee Handbook\n\n\n$19.00 - $23.36/hr. The actual hourly pay offered depends on various factors,\nincluding qualifications for the position and relevant experience; and other\nlegitimate, non-discriminatory business factors specific to the position or\nlocation. Sephora offers comprehensive healthcare and wellbeing benefits based\non eligibility; 401(k) savings plan; paid time off; employee discount/product\nperks; tuition reimbursement and employee referral bonus programs. \nWhile at Sephora, you 'll enjoy meaningful benefits details can be found\nhere: Click Here \nDiversity, Inclusion & Belonging We pledge to create a beauty community\nwhere everyone's uniqueness is celebrated, respected, and honored. We will\ndrive diversity, equity, and inclusion in all aspects of our business.",
    "company": "Sephora",
    "location": "Canoga Park, CA 91303",
    "zip_code": "91303",
    "job_tags": "401(k) | Employee discount | Health insurance | Paid time off | Referral program | Tuition reimbursement",
    "pay_min_hourly": 19,
    "pay_max_hourly": 23.36,
    "job_type": "Part-time",
    "posted_date_clean": "2023-08-25",
    "job_url": "https://www.indeed.com/viewjob?jk=bddbf3f9ed3bae6b",
    "soc_title": "Tour Guides and Escorts",
    "soc_code": "39-7011",
    "industry": "Business",
    "new_soc_code": "41-2031",
    "new_soc_title": "Retail Salespersons"
  },
  {
    "id": 2025537,
    "job_title": "Administrative Medical Assistant - Bilingual Spanish",
    "job_description": "Additional Comp Info: Salary based on experience. Overview:\n\nPlanned Parenthood of Orange and San Bernardino Counties has a full-time\nopportunity for an Administrative Medical Assistant-Bilingual Spanish in Costa\nMesa, CA.\n\nAdministrative position responsible for all duties and responsibilities\nassigned to front office staff. Responsibilities include greeting and\nchecking-in patients, preparing paperwork, scanning paperwork, determining\npayer source, collection of fees/receipts and donations, collection of IDs,\nphone answering, and scheduling. Must provide excellent customer service in a\nnon-judgmental, empathetic manner.\n\n* \nSchedule:* 4/10 work week which includes one weekend day.\n\nAt PPOSBC, we understand the importance of a well-rounded benefits program and\nare dedicated to providing you with unique benefits that meet the needs of you\nand your family. We are proud to offer a range of plans that help protect you\nin the case of illness or injury including:\n\n\n* A competitive benefits package including medical, dental, and vision coverage for you and eligible dependents, life insurance, and long term disability. \n* Benefits coverage starts after one full month of employment!\n* Generous vacation, sick, and holiday benefits!\n* Generous 401(k) matching contributions and more!\n* To view our detailed benefits guide, please visit our career site at * _www.pposbccareers.org_*\n\n\nQualifications:\n\n\n* High school diploma or other education plus experience required. \n* 1-3 years of continued job experience required.\n* Healthcare or general receptionist experience required.\n* Bilingual Spanish required. Some positions require bilingual skills (reading, writing, and speaking). If required, candidate will be tested for proficiency prior to offer.\n\n\nAll employees are required to be fully vaccinated and received a booster for\nCOVID-19 unless a reasonable accommodation is a pproved for a\nmedical/disability or religious exemption .\n\n_ \nPlanned Parenthood/Orange and San Bernardino Counties is an equal opportunity\nemployer. Applicants will receive consideration for employment without regard\nto race, color, ancestry, national origin, religion, creed, equal pay, age,\ndisability, sex, gender, sexual orientation, gender identity, gender\nexpression, medical condition, genetic information, marital status, military,\nveteran status or any other federal or state protected class. _We are\ncommitted to building and maintaining an inclusive workplace that values\ndiversity, equity, and inclusion.\n\nResponsibilities:\n\nTo perform this job successfully, an individual must be able to perform each\nessential duty satisfactorily. The requirements listed below are\nrepresentative of the knowledge, skill, and/or ability required. Reasonable\naccommodations may be made to enable individuals with disabilities to perform\nthe essential functions.\n\n\n* Adhere to agency's policies, procedures and protocols. This may include successfully completing agency, regional and/or state certification requirements.\n* Adhere to affiliate goals and policies on professionalism, wait time in-clinic and on the system for addressing client complaints.\n* Participate in health center efforts to achieve established goals for productivity.\n* Participate in health center/affiliate efforts to achieve established revenue cycle goals.\n* Perform the following functions: \n\n* Greet patients, answer phones, refer calls, schedule appointments\n* Prepare charts, check for completeness, errors, signature and appropriate assembly\n* Input and update computer patient data information accurately.\n* Maintain patient records\n* Assess client finances, which may include verifying insurance, health plan authorization, Medi-Cal cards with picture ID, collecting fees per agency guidelines, complete appropriate forms and obtain signatures per agency policy.\n* Collect donations and patient satisfaction surveys per agency guidelines. \n* Complete related financial/statistical paperwork for clients.\n* Monitor clinic flow.\n* Schedule appointments for family planning including but not limited to contraceptives and abortion services.\n* Perform clerical and administrative duties, as required by manager.\n\n\n\nMinimum Salary Range: USD $38,000.00/Yr. Maximum Salary Range: USD\n$50,900.00/Yr.",
    "company": "Planned Parenthood of Orange and San Bernardino Counties",
    "location": "Costa Mesa, CA 92626",
    "zip_code": "92626",
    "job_tags": "401(k) | 401(k) matching | Dental insurance | Disability insurance | Health insurance | Life insurance | Vision insurance",
    "pay_min_hourly": 18.27,
    "pay_max_hourly": null,
    "job_type": "Full-time",
    "posted_date_clean": "2023-08-25",
    "job_url": "https://www.indeed.com/viewjob?jk=a70161147bab7580",
    "soc_title": "Tour Guides and Escorts",
    "soc_code": "39-7011",
    "industry": "Business",
    "new_soc_code": "unavailable",
    "new_soc_title": "unavailable"
  },
  {
    "id": 2025560,
    "job_title": "Janitor",
    "job_description": "Pay Rate: $17.21 per hour Telecommute Status: Onsite Announcement: PRIDE\nIndustries is a fast-paced company with a mission: To Create Jobs for People\nwith Disabilities while providing high quality, value-added solutions to our\nnationwide customers. We are currently recruiting to fill the following\nposition: Job Description:\n\nPRIDE Industries\n\nJob Description\n\n* \nJob:* Janitor\n\nJob Code: 429 - NV-Janitor\n\nSCA Occup: 11150 Janitor\n\nSalary Grade: Federal Wage Determination or Collective Bargaining\nAgreement\n\nFLSA Status: Non-Exempt\n\nApproval Date: January 2018\n\n* \nPOSITION SUMMARY:* \nUnder close supervision, performs general custodial services in customer\nlocations or other assigned area(s), including cleaning and detailing\nconference rooms, offices, cafeteria, courthouses, classrooms, government\nfacilities and common areas. Employees in this job class use proper materials\nand methods to assure facilities are clean and free of safety hazards. This\njob class requires knowledge of custodial practices, equipment, supplies and\nprocedures, and the ability to perform quality work in a safe manner.\n\n* \nTYPICAL DUTIES:* \n1. * Performs cleaning services using proper equipment and supplies, and\nfollows procedures for safe use and operation. \n2. * Cleans facilities, restrooms, common areas, cafeterias. \n3. * Removes trash, replaces plastic trash bags. \n4. * Dusts and polishes equipment, furniture, or fixtures. \n5. * Cleans tables and microwaves. \n6. * Vacuums carpets, sweeps, mops, and deodorizes floors. \n7. * Cleans walls, arranges furniture, and cleans window blinds. \n8. * Uses correct chemicals on all surfaces, fills all dispensers. \n9. * Maintains quality of work and customer satisfaction. Responds to\ncustomer requests according to established procedures, or refers to\nsupervisor. \n10. * Cleans spills promptly. \n11. * Cleans and maintains custodial equipment to ensure proper operation and\nsafe condition. \n12. May wax and buff floors on a regular basis. \n13. May operate equipment such as a cardboard bailer. \n14. May monitor inventory and supply areas. \n15. Performs other duties and special projects as assigned.\n\n\n* \nDenotes Essential Job Function\n\n\n* \nMINIMUM QUALIFICATIONS* :  \n\n\n* 0 to 1 year of work experience, preferably in custodial services;\n* Ability to follow instructions on labels for proper and safe use of chemicals, supplies and equipment; \n* Ability to follow structured process and procedures, and to learn to use specialized departmental equipment, including that used in custodial services such as scrubbers and buffers;\n* Ability to communicate effectively and respond to questions and requests from customers and others; including ability to identify and report product and equipment needs;\n* Human relations skills to build effective working relationships;\n* Availability to work evenings; flexibility of schedule changes, work duration and task assignments;\n* Ability to manage and accurately track material resources and time, and adapt to changing work priorities;\n* Demonstrated organizational, problem solving and common sense skills.\n\n\n* \nEDUCATION REQUIREMENTS:*\n\nNot Applicable\n\n* \nCERTIFICATES OR LICENSES REQUIRED:*\n\nThe following licenses or certificates may be required depending on local,\nstate and/or contract requirements:\n\nNot Applicable\n\n* \nPHYSICAL REQUIREMENTS:*\n\nEmployees must have the ability to perform the following physical demands for\nextended periods of time with or without assistance:\n\n\n* Maneuvering in and around the worksite\n* Standing and walking \n* Bending, kneeling, reaching, and stooping \n* Lifting boxes or equipment weighing up to 35 pounds, and up to 50 pounds occasionally \n* Pushing or pulling objects such as vacuums, carts, mops, etc.\n* May be required to push/pull equipment weighing up to 70 pounds \n* Grasping both small & large objects \n* Climbing ladders and/or step stools\n\n\n* \nWORK ENVIRONMENT:*\n\nWork is performed in an office environment, or at a customer's location, such\nas a commissary environment, a federal courthouse, or a military base.\nEmployees may be exposed to toxic chemicals, noise from equipment in\nmaintenance environment, and depending on indoor and outdoor conditions,\nexposure to cold or heat.\n\n* \nDISCLAIMER:*\n\nThe above information on this description has been designed to indicate the\ngeneral nature and level of work performed by employees within this\nclassification. It is not designed to contain or be interpreted as a\ncomprehensive inventory of all duties, responsibilities, and qualifications\nrequired of employees to this job. Employees are expected to follow their\nsupervisor's instructions and to perform the tasks requested by their\nsupervisors.\n\n_ \nAt PRIDE, we make a difference in the lives of many, one job at a time._\n\nHow to Apply:\n\nIf you are interested in working for this unique organization that blends\nbusiness with a social mission, please apply online at\nwww.prideindustries.com.PRIDE Industries is a VEVRAA federal contractor\ncommitted to creating a diverse environment and is proud to be an equal\nopportunity employer. All qualified applicants will receive consideration for\nemployment without regard to race, color, religion, sex, gender identity or\nexpression, sexual orientation, national origin, marital status, genetics,\ndisability, age, or veteran status. Visit our website to learn more!\n\nPRIDE will not discharge or in any other manner discriminate against employees\nor applicants because they have inquired about, discussed, or disclosed their\nown pay or the pay of another employee or applicant. However, employees who\nhave access to the compensation information of other employees or applicants\nas a part of their essential job functions cannot disclose the pay of other\nemployees or applicants to individuals who do not otherwise have access to\ncompensation information, unless the disclosure is (a) in response to a formal\ncomplaint or charge, (b) in furtherance of an investigation, proceeding,\nhearing, or action, including an investigation conducted by the employer, or\n(c) consistent with the contractor's legal duty to furnish information. 41 CFR\n60-1.35(c)\n\nPRIDE will consider for employment all qualified applicants with criminal\nhistories in a manner consistent with the requirements of all federal, state,\nand local laws.",
    "company": "PRIDE Industries",
    "location": "Port Hueneme, CA 93041",
    "zip_code": "93041",
    "job_tags": "NaN",
    "pay_min_hourly": 17.21,
    "pay_max_hourly": null,
    "job_type": "Full-time",
    "posted_date_clean": "2023-08-25",
    "job_url": "https://www.indeed.com/viewjob?jk=a3c51fff4d72fa43",
    "soc_title": "Janitors and Cleaners, Except Maids and Housekeeping Cleaners",
    "soc_code": "37-2011",
    "industry": "Business",
    "new_soc_code": "37-2011",
    "new_soc_title": "Janitors and Cleaners, Except Maids and Housekeeping Cleaners"
  },
  {
    "id": 2025608,
    "job_title": "Medical Assistant ( MA ) for Obgyn office FRONT & BACK OFFICE AVAILABLE",
    "job_description": "Medical Assistant ( MA ) needed for a woman's health (ob/gyn) office in Marina\nDel Rey. We have both a front office position and back-office position\navailable. Must have excellent customer service skills, be a HARD WORKER, good\nsense of humor, WARM/ OUTGOING personality. Medical Assistant MA certificate\nis a plus but not a must. We are willing to train candidate in any of the\ntopics that they are not familiar with. Bilingual English/Spanish speaking is\nideal. Our office is a state-of-the-art OBGYN office in beautiful Marina Del\nRey. The doctors are very pleasant to work with and make it a point to make\nsure everyone works as a team! Our staff creates a very upbeat fun work\nenvironment, and everyone is welcoming.\n\nJob Type: Full-time\n\nPay: $15.00 - $21.00 per hour\n\nBenefits:\n\n\n* Paid time off\n\n\nSchedule:\n\n\n* 8 hour shift\n\n\nWork setting:\n\n\n* In-person\n\n\nExperience:\n\n\n* Phlebotomy: 1 year (Preferred)\n* medical assisting: 1 year (Required)\n\n\nWork Location: In person",
    "company": "Marina ObGyn",
    "location": "Marina del Rey, CA 90292",
    "zip_code": "90292",
    "job_tags": "Paid time off",
    "pay_min_hourly": 15,
    "pay_max_hourly": 21,
    "job_type": "Full-time",
    "posted_date_clean": "2023-08-25",
    "job_url": "https://www.indeed.com/viewjob?jk=c1ac7621a747aaa6",
    "soc_title": "Medical Secretaries and Administrative Assistants",
    "soc_code": "43-6013",
    "industry": "Business",
    "new_soc_code": "31-9092",
    "new_soc_title": "Medical Assistants"
  },
  {
    "id": 2025639,
    "job_title": "Inside Sales/Office Assistant (Full time)",
    "job_description": "Inside Sales/Office Assistant (Full time)\n\n20-year Security Hardware Company is looking for an ambitious and motivated\nnew team member to join us!\n\nMEI Lock & Security is seeking an entry-level inside Sales Representative\nwho's talented, hard-working, and would like an opportunity to grow both\npersonally and professionally.\n\nWe're a well-established company offering a high-growth potential position!!\n\nHourly:\n\n$20~$25 based on experience\n\nResponsibilities:\n\n\n* Taking & making phone calls\n* Assist with all walk-in customer and sales calls\n* Coordinate order processing with the sales manager and all team members.\n* work with production team and shipping personnel daily\n* Maintaining accounts\n\n\nKey requirements:\n\n\n* Strong phone presence and aggressive on phone calls\n* Successful completion of college diploma or equivalent education level\n* Proficient working knowledge on basic MS office programs (Word, Excel, Outlook &, etc)\n* Able to travel outside of the US\n* Sales/customer service experience (preferred, but not mandatory)\n* Bilingual in either Spanish or Chinese (Mandarin) is a plus\n* Experience with QuickBooks system is also a plus\n\n\nQualifications:\n\n\n* Follow up with customer during all stages of the sales cycle\n* Collaborate with all departments including sales, production, shipping, and customer service.\n* Detail-oriented with excellent organizational and multitasking skills\n* Ability to work efficiently\n\n\nBenefits offered:\n\n\n* Company will provide product training\n* Full coverage health benefits (Medical & Dental)\n* Vacation and paid sick leave\n* Sales commission/Semi-annual bonus base on performance\n* Retirement plan: 401K\n\n\nJob Type: Full-time\n\nPay: $20.00 - $25.00 per hour\n\nBenefits:\n\n\n* Dental insurance\n* Health insurance\n* Paid time off\n* Retirement plan\n\n\nSchedule:\n\n\n* 8 hour shift\n* Monday to Friday\n\n\nSupplemental pay types:\n\n\n* Bonus opportunities\n* Commission pay\n\n\nEducation:\n\n\n* High school or equivalent (Preferred)\n\n\nWork Location: In person",
    "company": "MEI LOCK & SECURITY",
    "location": "Chino, CA 91710",
    "zip_code": "91710",
    "job_tags": "401(k) | Dental insurance | Health insurance | Paid sick time | Paid time off | Retirement plan",
    "pay_min_hourly": 20,
    "pay_max_hourly": 25,
    "job_type": "Full-time",
    "posted_date_clean": "2023-08-25",
    "job_url": "https://www.indeed.com/viewjob?jk=db1ccbf82ca218a6",
    "soc_title": "Secretaries and Administrative Assistants",
    "soc_code": "43-6010",
    "industry": "Business",
    "new_soc_code": "41-3099",
    "new_soc_title": "Sales and Related Workers, All Other"
  },
  {
    "id": 2025675,
    "job_title": "PM Dispatch Clerk",
    "job_description": "Dependable Highway Express (DHE), a large transportation company, seeks a\nPM Dispatch Clerk to work in our LTL Division at our Los Angeles\nService Center . Dependable is a stable and rapidly expanding Trucking and\nWarehousing company with long roots in Los Angeles Transportation. We are\nlooking for a positive attitude and a team player.\n\nJob Function:\n\nPM Driver Check In Clerk will assist department staff to maximize customer\nservice through effective dispatch and driver coordination\n\nJob Responsibilities:\n\n\n* Data Entry\n* Assist dispatch with communicating work assignments to Linehaul drivers\n* Complete and maintain spreadsheets\n\n\nJob Requirements:\n\n\n* Knowledge of U.S. geography\n* Experience dealing with Truckload Carries\n* Able to multitask and to provide support\n* Effective verbal, written and interpersonal communication skills\n* Regional Transportation Industry knowledge or equivalent preferred\n* Intermediate computer skills including Microsoft Word, Excel, and Outlook preferred\n* Willingness to be cross-trained in other departments such as dispatch\n* High School Diploma or higher a plus\n* Able to work 40+ hours a week\n\n\nCompensation / Benefits:\n\nDHE compensation package includes a competitive salary, annual merit reviews,\nand annual performance bonuses. Our comprehensive benefit program includes\nmedical plan, dental plan, vision plan, 401k, 125 flex spending plan,\nvacation/sick time, and tuition reimbursement.\n\nJob Type: Full-time\n\nPay: $20.00 - $22.00 per hour\n\nExpected hours: 40 per week\n\nBenefits:\n\n\n* Dental insurance\n* Health insurance\n* Tuition reimbursement\n* Vision insurance\n\n\nSchedule:\n\n\n* 8 hour shift\n* Night shift\n\n\nExperience:\n\n\n* Dispatching: 1 year (Preferred)\n\n\nWork Location: In person",
    "company": "Dependable Supply Chain Services",
    "location": "Los Angeles, CA 90023",
    "zip_code": "90023",
    "job_tags": "401(k) | Dental insurance | Health insurance | Tuition reimbursement | Vision insurance",
    "pay_min_hourly": 20,
    "pay_max_hourly": 22,
    "job_type": "Full-time",
    "posted_date_clean": "2023-08-25",
    "job_url": "https://www.indeed.com/viewjob?jk=5e7a37cdc0110181",
    "soc_title": "Office and Administrative Support Workers, All Other",
    "soc_code": "43-9199",
    "industry": "Business",
    "new_soc_code": "43-5051",
    "new_soc_title": "Dispatchers, Except Police, Fire, and Ambulance"
  },
  {
    "id": 2025682,
    "job_title": "Product Engineer II",
    "job_description": "United States of America\n\nState / County\n\nCalifornia\n\nCity\n\nGardena\n\nDivision\n\nEPD\n\nCompany\n\nPermaswage Gardena\n\nFunction\n\nEngineering\n\nWorkplace Type\n\nOn-Site\n\nPosition type\n\nFull Time\n\nOpportunity ID\n\n10030\n\nCompany Profile\n\nWith more than 120 operations and approximately 20,000 employees worldwide,\nPrecision Castparts Corp. is the market leader in manufacturing large, complex\nstructural investment castings, airfoil castings, forged components,\naerostructures and highly engineered, critical fasteners for aerospace\napplications. In addition, we are the leading producer of airfoil castings for\nthe industrial gas turbine market. We also manufacture extruded seamless pipe,\nfittings, and forgings for power generation and oil & gas applications;\ncommercial and military airframe aerostructures; and metal alloys and other\nmaterials for the casting and forging industries. With such critical\napplications, we insist on quality and dependability - not just in the\nmaterials and products we make, but in the people we recruit.\n\nPCC is relentless in its dedication to being a high-quality, low-cost and on-\ntime producer; delivering the highest value to its customers while continually\npursuing strategic, profitable growth.\n\nIn 2016, Berkshire Hathaway, led by Chairman and CEO Warren E. Buffett,\nacquired Precision Castparts Corp.\n\nJob Description\n\nProduct Engineer II\n\nLocation & Business Profile:\n\nHeadquartered in Gardena California, PCC Fluid Fittings designs and\nmanufactures separable and permanent fluid fittings and installation tooling\nfor aerospace and defense applications. PCC Fluid Fittings, owned by PCC, is a\nmulti-national business with plants in France, Mexico, and China. The products\nmanufactured by PCC Fluid Fittings flies on a significant percentage of\nwestern-designed aircraft. Many of these parts were designed and qualified in-\nhouse, and PCC Fluid Fittings continues to maintain status as the cognizant\nengineering authority on the performance and application of those fittings\nwithin the industry. PCC Fluid Fittings also takes great pride in its\nconcurrent engineering approach to design and manufacturing, and great-focus\nis placed on operating safely, productively, at a high quality-level, and\nprofitably.\n\nPosition Summary:\n\nThe Product Engineer II is a leader within the Product Engineering team. This\nrole is primarily focused on the introduction of new product, and improvements\nin the introduction process - from customer through first-time manufacture. In\nthis role, the employee will have ownership over the introductory process\nwithin the engineering team, will work with sales and the customer to ensure\nrequirements are met, and work with both Manufacturing Engineering and\nOperations to ensure the necessary process controls exist for manufacturing.\nAlso, in this role the employee will use project management tools to track and\nimplement strategic projects. In cases where testing or product validation is\nrequired, the Product Engineer II will develop test plans with the customer\nand will coordinate the testing with the R&D Lab team.\n\n*Primary Duties & Responsibilities: *\n\n\n* Introductory product lifecycle management - from customer through manufacturing onboarding of new product \n\n* Working with the customer to define CTQ characteristics and product application requirements\n* Test plans or statements of work for the creation of test plans to validate product will meet customer requirements through coordination with the Engineering R&D test lab\n* Working with the Sales team to ensure the correct items are identified and that internal Engineering requirements are understood prior to order entry\n* New Product Introduction (NPI) and Item setup in the ERP system\n* Internal manufacturing drawing creation/coordination and creation of process specifications, if required\n* Defining Key Characteristics for product manufacturing and setup/coordination of SPC Plans with the Mfg. Engineering team to ensure customer requirements are met\n* Working with Mfg. Engineering to ensure raw materials or forging requirements are defined\n\n* Good project management skills \n\n* Maintain clear, concise, and structured project trackers, with milestones, for strategic onboarding projects, including actions, owners, due dates, and financial opportunity\n* Write clear and concise statements of work for customer-driven or new product development and introduction projects\n\n* Ability to take the lead within the Engineering team on project management, driving assigned actions and tasks, and to support less experienced engineers\n* Work with sales to perform basic cost-analysis, support quoting, and be a go-to technical resource for the customer\n* Drive continuous improvement of Engineering team administrative processes, such as engineering change orders, new product introduction, drawing creation/release, project requests from sales/customer/manufacturing, R&D lab production support, workflow processes, project requests, and creation of procedures\n* Create engineering report-outs and presentations to senior management on major projects, including intelligently walking through project timelines, milestones, metrics or KPI's, and the action plan/next steps\n* Develop a detailed working knowledge of the fluid fittings product design, application, and manufacturing, and be able to perform true root-cause-analysis with teams of Engineers and members of other departments when deviations from process/procedure occur\n* Writing and releasing work instructions, process specifications, and operating procedures related to plant engineering activities and technical manufacturing requirements\n* May occasionally perform special duties or projects, as assigned.\n\n\nEducation and Experience Requirements:\n\n\n* S. in an Engineering discipline\n* 3+ years of Engineering experience in an aerospace manufacturing environment\n* A track-record of working on successful, results-driven engineering projects\n* Project management experience with successful project outcomes\n* A track-record of successful problem solving using robust logic, RCCA, 8D, 5 Why, etc.\n* Firm skill-set with the Microsoft Suite - Excel, Word, Visio, Powerpoint, and Project\n* Experience creating Solidmodels and Drawings using Solidworks or CATIA\n* Experience in managing product data (drawings, models, processes, procedures) using a PDM software\n* Experience in process mapping and in deployment of process improvement tools to develop and deploy the future state\n* Experience in developing and working with test plans for validation or development of new product, and for trouble-shooting existing product.\n* Experience in the adherence, or creation, of project metrics and KPI's\n\n\n* \nQualifications:*\n\n\n* Excellent communication skills, both written and verbal, both within the organization and with customers or vendors/suppliers\n* Ability to work well with individuals inside and outside of the organization\n* Mechanically-oriented, and having demonstrated hand-on mechanical abilities\n* Fundamental Microsoft Windows computer skills, including but not limited to, organized management of file folders, shared files, managing file types, and desktop setup\n* Ability to interpret, analyze, and draw conclusions from complex data or information\n* Demonstrated cross-functional management ability across multiple departments\n* Ability to deal with ambiguity, and to guide others through highly ambiguous problems\n* Ability to apply rigorous logic and scientific thinking to a wide range of intellectual and practical problems\n* Ability to Create and Interpret Engineering Drawings, including GD&T, and ability to work with Solidworks or CATIA solid models\n* Working knowledge of Statistical Process Control in a high-mix, medium-volume manufacturing environment\n* Ability to interpret and produce well-written, clear, and concise technical procedures.\n* Working knowledge and demonstrated use of ERP/MRP/MES systems\n* Previous design, product development, and product lifecycle management experience a plus\n* Working knowledge and ability to develop current state Process maps, identify improvements, develop future state process maps, and new processes implementation\n* Familiarity with phase-gate type process workflows\n* Exposure to Design for Six Sigma and/or Lean/Six Sigma training (either formal, or informal) preferred\n\n\n* \nPhysical Demands:*\n\n\n* While performing the duties of this job, the employee is regularly required to talk or hear.\n* The employee frequently is required to stand and walk.\n* The employee is occasionally required to sit; use hands to finger, handle, or feel; and reach with hands and arms.\n* The employee must frequently lift and/or move up to 10 pounds and occasionally lift and/or move up to 40 pounds.\n* Specific vision abilities required by this job include close vision, color vision, depth perception, and ability to adjust focus.\n* The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n\nAll qualified applicants will receive consideration for employment without\nregard to race, color, religion, sex, sexual orientation, gender identity,\nnational origin, disability, or status as a protected veteran.\n\nFor informational purposes only, the range of pay for this role is $78,800 to\n$98,500 US Dollar (USD) Salaried based on a variety of factors. For\ninformational purposes only, this role is eligible to participate in the\nCompany's Quarterly Cash Bonus Plan, paid out at the quarterly bonus factor of\n2X the Company's bonus multiple, based on the Company's performance in the\napplicable quarter. Employees will receive 120 hours paid time off every year.\nEmployees will also receive 10 paid holidays. Employees (and their families)\nare eligible to participate in the company's medical, dental, vision, and\nbasic life insurance. Employees are eligible to enroll in the Company's 401(k)\nplan.",
    "company": "Precision Castparts Corp.",
    "location": "Gardena, CA 90249",
    "zip_code": "90249",
    "job_tags": "401(k) | Dental insurance | Health insurance | Life insurance | Paid time off | Vision insurance",
    "pay_min_hourly": 37.88,
    "pay_max_hourly": 47.36,
    "job_type": "Full-time",
    "posted_date_clean": "2023-08-25",
    "job_url": "https://www.indeed.com/viewjob?jk=79db1ae8dedae562",
    "soc_title": "Tour Guides and Escorts",
    "soc_code": "39-7011",
    "industry": "Business",
    "new_soc_code": "17-2141",
    "new_soc_title": "Industrial Engineers"
  },
  {
    "id": 2025729,
    "job_title": "Office Intake",
    "job_description": "Office Intake with Hospice Experience. Spanish speaking is plus.\n\nJob Type: Full-time\n\nPay: $18.80 - $22.65 per hour\n\nBenefits:\n\n\n* 401(k)\n* Dental insurance\n* Health insurance\n* Paid time off\n* Vision insurance\n\n\nSchedule:\n\n\n* 8 hour shift\n\n\nSupplemental pay types:\n\n\n* Bonus opportunities\n\n\nAbility to commute/relocate:\n\n\n* Woodland Hills, CA 91364: Reliably commute or planning to relocate before starting work (Required)\n\n\nExperience:\n\n\n* Customer service: 1 year (Preferred)\n\n\nWork Location: In person",
    "company": "Grace and Comfort Hospice",
    "location": "Woodland Hills, CA 91364",
    "zip_code": "91364",
    "job_tags": "401(k) | Dental insurance | Health insurance | Paid time off | Vision insurance",
    "pay_min_hourly": 18.8,
    "pay_max_hourly": 22.65,
    "job_type": "Full-time",
    "posted_date_clean": "2023-08-25",
    "job_url": "https://www.indeed.com/viewjob?jk=a0058dba6e4ed0ee",
    "soc_title": "Secretaries and Administrative Assistants",
    "soc_code": "43-6010",
    "industry": "Business",
    "new_soc_code": "43-6011",
    "new_soc_title": "Receptionists and Information Clerks"
  },
  {
    "id": 2025825,
    "job_title": "Concierge - Part Time!",
    "job_description": "Concierge - Part Time - Hiring Immediately!\n\nTuesday AM/Saturday PM Shift; On Call\n\nPay Range: $15.50 to $16.25\n\nOakmont of * _Camarillo_* * __* is a premier senior living community\nsituated on a beautifully landscaped campus. Managed by Oakmont Management\nGroup, Oakmont of * _Camarillo provides_* exceptional quality,\ncomfort, and care with five-star services and amenities. Residents enjoy a\nrewarding lifestyle with individualized comprehensive support that promotes\ncontinuing independence. We deliver meaningful lifestyles and relationships\nwith residents, families, and team members by developing a winning culture and\nliving these values: Authenticity * Teamwork * Compassion * Commitment *\nResilience.\n\nWith communities across California, Hawaii, and Nevada, opportunities for\ncareer growth, relocation, and travel are significant. In addition, eligible\nteam members may enjoy the following benefits:\n\n\n* Medical, Dental, and Vision benefits\n* Vacation, Personal Day, Sick Pay, Holidays\n* Complimentary Meals\n* Bonus Opportunities\n* Company Paid Life Insurance\n* Team Member Discount Program (LifeMart)\n* 401(k) Savings Plan with Company Match\n* Recognition Programs\n* Student Loan Refinancing\n* Tuition Reimbursement\n* Pet Insurance\n* Employee Assistance Program\n* Emergency Financial Assistance\n\n\nThe Concierge is responsible for greeting visitors, fulfilling resident\nrequests, arranging tours of the property, answering a multi-line telephone,\nand providing clerical support to the administrative staff, in accordance with\nthe company's mission and values.\n\nResponsibilities :\n\n\n* Provide all residents, guests, and visitors with exceptional customer service.\n* Answer telephones, record, and/or direct calls to appropriate individuals in a timely, clear, concise, and professional manner.\n* Monitor the Emergency Alert System and immediately respond to every call.\n* Effectively manage business center and process incoming and outgoing mail.\n* Maintain a safe and secure environment for all staff, residents, and guests, following established safety standards.\n* Encourage teamwork through cooperative interactions with co-workers and other departments.\n\n\nQualifications :\n\n\n* Must be at least 18 years of age.\n* High school diploma or equivalent.\n* Prefer two (2) years of experience in a hospitality setting or prior senior living community.\n* Excellent customer service skills.\n* Able to operate a personal computer and be proficient in MS Office programs (Word, Excel, etc.)\n* Possess written and verbal skills to interact and communicate effectively with employees, supervisors, physicians, healthcare professionals, residents, and their families.\n* Must pass a Criminal Background check and Health Screening tests, including physical and TB Tests\n* For the health and safety of our team members and residents, Oakmont Management Group may require team members to vaccinate, participate in daily screening, surveillance testing, and to wear face coverings and other personal protective equipment (PPE) to prevent the spread of the COVID-19 or other communicable diseases, per regulatory guidelines.\n\n\nOakmont Management Group, based in Irvine, California, is a recognized\nleader in the senior living industry that manages a portfolio of communities\nunder the Oakmont Senior Living and Ivy Living brands. OMG currently serves\nover 6,000 seniors across 64 communities in California, Hawaii, and Nevada. At\nOMG, we strive to create an atmosphere of family and community among team\nmembers, residents, and resident family members. We know that caring and\nmeaningful relationships are the foundation of a rewarding life, and our team\nis hand-selected for their skills, previous experience, and passion for\nworking with the elderly. Our practice is to incorporate joy and laughter\nalongside our expectations of excellence. Walk into our communities and feel\nour pride of ownership and commitment to service.\n\nOakmont Management Group is an Equal Opportunity Employer.",
    "company": "Oakmont Senior Living",
    "location": "Camarillo, CA 93012",
    "zip_code": "93012",
    "job_tags": "401(k) | 401(k) matching | Dental insurance | Employee assistance program | Employee discount | Health insurance | Life insurance | Paid sick time | Pet insurance | Store discount | Tuition reimbursement | Vision insurance",
    "pay_min_hourly": 15.5,
    "pay_max_hourly": 16.25,
    "job_type": "Part-time",
    "posted_date_clean": "2023-08-25",
    "job_url": "https://www.indeed.com/viewjob?jk=fd263a7a0785442a",
    "soc_title": "Miscellaneous Office and Administrative Support Workers",
    "soc_code": "43-9190",
    "industry": "Business",
    "new_soc_code": "39-6012",
    "new_soc_title": "Concierges"
  },
  {
    "id": 2025944,
    "job_title": "Temporary Faculty Pool, Reference, Instruction & Outreach Services Librarian",
    "job_description": "Campus: \nDominguez Hills\n\nJob ID: 527982\n\nJob Title: \nTemporary Faculty Pool, Reference, Instruction & Outreach Services Librarian\n(Full-time)\n\nDiscipline: \nLibrarian\n\nAppointment Type: \nTemporary\n\nTime Base: \nFull-Time\n\nDate Posted: \nMay 12, 2023\n\nClosing Date: \nJune 30, 2024\n\nDescription:  \n\nFull Time Temporary Faculty Pool\n\nReference, Instruction & Outreach Services (RIOS) Department\n\nUniversity Library\n\nPosition Description\n\nThe Reference, Instruction & Outreach Services (RIOS) Department at California\nState University, Dominguez Hills (CSUDH), invites highly qualified,\nmotivated, and well-organized, applicants for a pool of full-time temporary\nlibrarian appointments.\n\nAt CSUDH, we celebrate and respect diversity in all forms that include every\nrace, religion, gender, ethnicity, veterans, people with varied abilities, and\nmembers of the LGBTQ+ community. CSUDH is seeking applications from candidates\nwho can demonstrate experience in teaching and working with individuals from\ndiverse backgrounds and contribute to the University's mission, vision, and\ncore values.\n\nFor more information: Mission, Vision, and Core Values\n\nReference, Instruction & Outreach Services (RIOS) Department\n\nUniversity Library\n\nThe CSUDH University Library fosters student success, scholarly research, and\nacademic excellence through the provision of information resources, primary\nresources, learner-centered assistance and experiences, support of\nundergraduate research, and welcoming, technology-enhanced environments that\nfacilitate lifelong learning, collaboration, and innovation. The University\nLibrary is comprised of a talented and synergistic team of 12 library faculty\nand 22 staff members who are committed to the academic success for all users.\n\nAs a Hispanic-Serving Institution (HSI), our University Library is committed\nto facilitating thriving students and educators through a comprehensive suite\nof services that include 24/7 reference and research support; curricular-\ndriven information literacy instruction; robust physical and digital\ncollections; student-centered course reserves; Inter-Library Loan services;\nand an engaging learning environment. The beautifully designed physical\nbuilding boasts five spacious floors, all technology-enabled, and consisting\nof free access to PC and Mac computers, printers, and scanners; private\ncarrels; quiet and collaborative study spaces; outdoor study space; a coffee\nshop with a lounge area; and a range of seating and lighting options.\nContributions to the popular Affordable Learning Solutions program is a point\nof pride; the partnerships with faculty, the Bookstore, and Academic\nTechnology save students more than $1 million annually via our Toro Textbook\nLibrary program; Open Educational Resources; Bookstore Solutions; Library\nprint and eBooks; and faculty-selected Zero Cost and Low-Cost course\nmaterials.\n\nThe University Library is committed to fostering equity and creating and\nsustaining a diverse and inclusive environment. Recently, we examined our\npractices, policies and procedures through diversity, equity, inclusion, and\nsocial justice lenses, to revise these to reflect our commitment. Also, the\nUniversity Library completed a Diversity, Equity, and Inclusion Audit which\nidentified our strengths and opportunities with respect to our DEIJ imprint.\nThis report serves as a roadmap for our DEIJ actions.\n\nFor more information:\n\nThe Position\n\nThe faculty of the University Library at California State University Dominguez\nHills invites applications for full-time temporary librarian positions in the\nUniversity Library's Reference, Instruction, and Outreach Services (RIOS)\ndepartment. The temporary faculty pool is continuously open, and positions are\nfilled as needed, based on funding. Candidates may need to be available to\nbegin in a position on short notice.\n\nThe successful candidate will\n\n\n* Effectively provide research help through general reference services including instant message chat, phone, email, in-person, and research consultations\n* Develop lesson plans and instructional materials for information literacy instruction to general education (GE) courses in a variety of disciplines\n* Develop and edit research guides as needed\n* Teach within the library's information literacy program including in-person instruction and online tutorials in a variety of disciplines\n* Conduct outreach to new students and other university community populations as part of the RIOS team\n\n\nRequired Qualifications\n\n\n* Master's degree in Library and Information Science from an ALA accredited institution or an international equivalent, by the time of appointment\n* Ability to effectively participate in the areas of research consultation, instruction, and outreach\n* Applied knowledge of the ACRL Framework for Information Literacy for Higher Education\n* Strong problem-solving skills, and commitment to continuous learning\n* Excellent oral, written, and interpersonal communication skills\n* Ability to handle multiple responsibilities and to work collaboratively with internal and external stakeholders to carry out complex projects in a rapidly changing environment\n* Evidence of a commitment to social justice, diversity, anti-racism, and inclusion in library practice\n\n\nPreferred Qualifications\n\n\n* Demonstrated knowledge of Springshare products such as LibGuides, LibChat, and LibWizard\n* Experience providing reference services and research help both in-person and via chat\n* Experience teaching using active learning methods\n\n\nEmployment Requirement\n\nBackground Check\n\nSatisfactory completion of a background check (including a criminal records\ncheck) is required for employment. CSU will make a conditional offer of\nemployment, which may be rescinded if the background check reveals\ndisqualifying information, and/or it is discovered that the candidate\nknowingly withheld or falsified information. Failure to satisfactorily\ncomplete the background check may affect the continued employment of a current\nCSU employee who was conditionally offered the position.\n\nCSU COVID-19 Vaccination Policy\n\nThe California State University (CSU) is committed to safeguarding the health\nand well-being of our students, faculty, staff, administrators, and the\ncommunities we serve, as well as maintaining higher education access and\nattainment for our students, as such, we embrace a comprehensive strategy\ndesigned to reduce the likelihood of transmission of the COVID-19 virus. The\nCSU requires faculty, staff, and students who are accessing campus facilities\nto be immunized against COVID-19 or declare a medical or religious exemption\nif eligible. Any candidate advanced in a currently open search process should\nbe prepared to comply with this requirement. The system-wide policy can be\nfound at: CSU COVID-19 Vaccinations Policy .\n\nQuestions about the COVID-19 Vaccination Policy may be sent to hrm@csudh.edu .\n\nAdditional Information\n\nThe salary range for the Assistant Librarian (Range 2, 12-MONTH) is\n$5,168/month to $6,946/month and will be commensurate with the qualifications\nand experience of the candidate. The anticipated hiring range is $5,416/mo. to\n$5,666/mo.\n\nMandated Reporter Per CANRA\n\nThe person holding this position is considered a 'mandated reporter' under the\nCalifornia Child Abuse and Neglect Reporting Act (CANRA) and is required to\ncomply with the requirements set forth in CSU Executive Order 1083, revised\nDecember 24, 2021, as a condition of employment.\n\nHow to Apply- To apply for this position, please click the \"Apply Now\"\nbutton on this page.\n\nA complete application is required and must include:\n\n\n* Current Curriculum Vitae with contact information\n* Cover letter\n* Statement on diversity, equity, and inclusion in academic libraries\n* Unofficial transcripts (an official transcript will be required upon initial appointment)\n\n\nFor international transcripts, a United States Equivalency certification will\nbe required.\n\nA United States (US) Equivalency certification is required for\nearned/awarded/conferred foreign terminal degrees, which is from a foreign\nAcademic Institution for foreign studies. The US Equivalency certification is\nused to validate foreign studies from an academic credential evaluation agency\nand is evaluated on foreign studies and deemed to be equivalent to degrees\nfrom the United States. The certification must translate the information in\nEnglish, and confirm that your highest terminal degree is US Equivalent to a\nUS terminal degree (i.e., Bachelor 's, Master's, Doctorate's, Doctor's of\nPhilosophy). The certification can be emailed to _facultyaffairs@csudh.edu _or\nmailed directly to the Office of Faculty Affairs and Development, 1000 East\nVictoria Street, WH-368, Carson, CA 90747.\n\nClosing Statement\n\nCalifornia State University Dominguez Hills is an Affirmative Action/Equal\nOpportunity Employer. We consider qualified applicants for employment without\nregard to race, religion, color, national origin, ancestry, age, sex, gender,\ngender identity, gender expression, sexual orientation, genetic information,\nmedical condition, disability, marital status, or protected veteran status.\n\nFor more information: U.S. Equal Employment Opportunity Commission\n\nIndividuals with disabilities requesting accommodations under the Americans\nwith Disabilities Act (ADA) may call the CSU Dominguez Hills Human Resources\nOffice (310) 243-3771.\n\nClery Act crime statistics for CSUDH are available at Campus Security Report\n(Clery), or by calling University Police at (310) 243-3639.\n\nUpon appointment, all candidates must furnish proof of eligibility to work in\nthe United States.\n\nThe California State University is Smoke and Tobacco-Free. Smoking, Vaping and\nother Tobacco use are Not Permitted anywhere on University property. Education\nCode 42356, CCR Title 5, Article 9.\n\nFor more information see: Smoke & Tobacco-Free",
    "company": "California State University",
    "location": "Carson, CA 90747",
    "zip_code": "90747",
    "job_tags": "NaN",
    "pay_min_hourly": 31.31,
    "pay_max_hourly": null,
    "job_type": "Full-time",
    "posted_date_clean": "2023-08-25",
    "job_url": "https://www.indeed.com/viewjob?jk=470ce71ead2e8068",
    "soc_title": "Tour Guides and Escorts",
    "soc_code": "39-7011",
    "industry": "Business",
    "new_soc_code": -3996,
    "new_soc_title": "Librarians"
  }
]